cask_args appdir: "~/Applications", require_sha: true

brew 'awscli'
brew 'chrome-cli'
brew 'fribidi'
brew 'gh'
brew 'go'
brew 'harfbuzz'
brew 'jesseduffield/lazygit/lazygit'
brew 'jq'
brew 'just'
brew 'libffi'
brew 'libmagic'
brew 'libxmlsec1'
brew 'neovim', args: ['HEAD']
brew 'node'
brew 'pnpm@9'
brew 'postgresql@14'
brew 'pre-commit'
brew 'qmk/qmk/qmk'
brew 'rabbitmq'
brew 'redis'
brew 'ripgrep'
brew 'ruff'
brew 'semgrep'
brew 'tldr'
brew 'tmux'
brew 'uv'
brew 'wget'

cask '1password'
cask 'cleanshot'
cask 'firefox'
cask 'google-chrome'
cask 'iterm2'
cask 'karabiner-elements'
cask 'lunar'
cask 'maccy'
cask 'ngrok'
cask 'nikitabobko/tap/aerospace'
cask 'notunes'
cask 'qmk-toolbox'
cask 'raycast'
cask 'scroll-reverser'
cask 'shifty'
cask 'visual-studio-code'
cask 'vlc'

# fonts
cask 'font-hack-nerd-font'
cask 'font-meslo-lg-nerd-font'

