brew 'chrome-cli'
brew 'fribidi'
brew 'gh'
brew 'go'
brew 'harfbuzz'
brew 'jesseduffield/lazygit/lazygit'
brew 'jq'
brew 'koekeishiya/formulae/skhd'
brew 'libffi'
brew 'libmagic'
brew 'libxmlsec1'
brew 'neovim'
brew 'node'
brew 'postgresql@14'
brew 'pre-commit'
brew 'pyenv'
brew 'rabbitmq'
brew 'redis'
brew 'ripgrep'
brew 'semgrep'
brew 'wget'

cask '1password'
cask 'raycast'
cask 'visual-studio-code'
cask 'vlc'
